package com.ifmo.course;

public class Main {
    public static void main(String[] args) {
        //задача 1
        /*Пользователь! загадывает число в диапазоне от [1 до 100],
        программа пытается его угадать (используйте метод бинарного поиска - деление отрезка на 2).
        Программа может задавать пользователю вопросы: Число равно X? / Число больше X? / Число меньше X?
        и в зависимоти от ответа пользователя принимать решения.
        PS: вместо текстовых ответов ДА/НЕТ, используйте числа 0 - НЕТ и 1 - ДА*/
        System.out.println("Задача 1");
    }
}
